
/*
Напишите программу, выводящую на экран таблицу умножения на 7, в виде списка.

 */


public class SevenFor {
    public static void main(String[] args) {
        for (int i = 1; i < 11; i++) {
            System.out.println(7 + " * " + i + " = " + 7 * i);
        }
    }
}
